CATEGORY_MAPPING = {
    # Кузовные детали (BODY)
    'BODY': {
        'title': 'Кузовные детали',
        'subcategories': [
            'Порог кузова', 'Крыша', 'Стекло заднее', 'Петли крышки багажника', 'Накладка на стойку кузова',
            'Накладка проема багажника', 'Лючок бензобака', 'Дверь', 'Расширитель крыла', 'Бампер',
            'Решетка радиатора', 'Заглушка бампера', 'Замок капота', 'Крыло', 'Лобовое стекло',
            'Накладка жабо', 'Накладка ПТФ', 'Петли дверей', 'Петля капота', 'Подкрылки', 'Подкрылок',
            'Порог нижний', 'Порог со средней стойкой', 'Порог со стойкой', 'Средняя стойка с порогом',
            'Стекло двери', 'Форточка', 'Часть кузова', 'Четверть', 'Фаркоп', 'Стойка крыши',
            'Стойка кузова', 'Молдинг двери', 'Панель телевизора', 'Амортизатор багажника',
            'Амортизаторы крышки багажника', 'Бархотка стекла', 'Дефлектор', 'Кожух решетки радиатора',
            'Кронштейн бампера', 'Молдинг крыши', 'Накладка замка багажника', 'Накладка крыла',
            'Накладка стойки наружняя', 'Направляющие стекла', 'Ограничитель двери', 'Окантовка ПТФ',
            'Пыльник крыла', 'Резинка жабо', 'Ручка открывания капота', 'Уголок зеркала',
            'Уплотнители дверных проемов', 'Уплотнители крышки багажника', 'Уплотнитель дверного проема',
            'Уплотнительная резинка под жабо', 'Накладка с камерой заднего вида', 'Спойлер крышки багажника',
            'Водосток', 'Личинка замка багажника', 'Накладка бампера', 'Решетка бампера',
            'Комплектующие крышки багажника', 'Амортизатор капота', 'Сабля крышки багажника',
            'Кронштейны бампера', 'Крылья', 'Лонжерон', 'Ноускат', 'Телевизор',
            'Зеркало заднего вида салонное', 'Зеркало заднего вида', 'Боковое зеркало', 'Зеркало двери',
            'Зеркала заднего вида', 'Зеркало', 'Стекла дверей', 'Стекло', 'Форточка двери',
            'Брызговики', 'Рейлинг крыши', 'Крючок капота', 'Эмблема решетка радиатора',
            'Эмблема крышки багажника', 'Обшивка крышки багажника', 'Обшивка части багажника', 'Двери', 'Задняя панель кузова', 'Крышка багажника',
            'Петли двери', 'Дверь боковая', 'Капот', 'Бампер под парктроники', 'Форточка крыла', 'Зеркала',
            'Стекло лобовое', 'Куски лонжерона', 'Заглушка ПТФ', 'Заглушка ПТФ бампера', 'Рейлинги крыши',
            'Жабо', 'Пороги', 'Площадка под номер', 'Форточки дверей', 'Комлектующие бампера',
            'Усилитель бампера', 'Решетка бампера ПТФ', 'Крыша со стойками', 'Жабо', 'Часть кузова фонаря', 'Сапожок',
            'Молдинг стекла двери', 'Зеркала заденего вида', 'Стакан', 'Порог'
        ]
    },

    # Детали салона (INTERIOR)
    'INTERIOR': {
        'title': 'Детали салона',
        'subcategories': [
            'Обшивка потолка', 'Накладка на порог салона', 'Консоль панели приборов', 'Бардачок',
            'Консоль магнитофона', 'Консоль между сидений', 'Центральная консоль с подлокотником',
            'Пластик салона', 'Ручник', 'Салон багажника', 'Ковролин', 'Крышка предохранителей',
            'Обшивка стоек', 'Накладка панели', 'Пол багажника', 'Полка багажника',
            'Сиденья комплект', 'Центральный тоннель', 'Накладка селектора МКПП', 'Накладка стойки крыши',
            'Подголовник сидения', 'Ручник и кулиса МКПП', 'Бардачок торпедо', 'Козырек панели приборов',
            'Ковролин салона', 'Молдинг порога салона', 'Накладка центральной консоли',
            'Накладки центральной стойки', 'Напольное покрытие', 'Накладка торпедо', 'Обшивка багажника',
            'Панель салона', 'Тоннель с подлокотником', 'Шумоизоляция моторного щита в салоне',
            'Ящик инструмента в багажник', 'Подрулевой кожух', 'Рамка магнитолы', 'Пороги салона',
            'Органайзер багажника', 'Накладки порогов нижние', 'Центральный плафон с подочечником',
            'Ящик для инструментов', 'Фальшпол', 'Кронштейн панели', 'Кольцо воздуховода',
            'Солнцезащитный козырек', 'Зеркало заднего вида салона', 'Потолок', 'Солнцезащитные козырьки', 'Воздуховод салона',
            'Накладка стойки', 'Торпедо', 'Полка салона задняя', 'Ремни безопасности', 'Педальный узел', 'Ручка потолка', 'Коврики салонные',
            'Плафон освещения салона', 'Накладка кузова внутри', 'Зеркало салона', 'Обшивка двери',
            'Торпедо с подушкой безопасности', 'Безопасность', 'Ряд сидений', 'Накладки торпедо боковые',
            'Сидения', 'Центральная консоль', 'Пластик на стойки', 'Накладки на воздухозаборник',
            'Дополнительный стоп-сигнал', 'Сиденья', 'Труба салона подпанельная', 'Потолок с панорамой', 'Механизм люка',
            'Ремень безопасности', 'Накладка на торпедо', 'Козырек солнцезащитный', 'Дефлектора печки',
            'Торпедо панель салона', 'Стрельнутые торпедо', 'Обшивки дверей', 'Центральный дефлектор',
            'Торпедо с подушками и ремнями', 'Торпедо с подушкой безопасности', 'Ряд кожанных сидений',
            'Накладки на стойки', 'Сиденье'
        ]
    },

    # Отопители и кондиционирование (HVAC)
    'HVAC': {
        'title': 'Отопители и кондиционирование',
        'subcategories': [
            'Компрессор кондиционера', 'Блок управления климат-контролем', 'Дефлектор воздушный',
            'Моторчик отопителя', 'Блок печки', 'Радиатор печки', 'Центральный дефлектор печки',
            'Дефлекторы печки', 'Климат-контроль', 'Блок управление печки',
            'Печка салона', 'Блок управления печки', 'Радиатор кондиционера', 'Корпус отопителя мотор',
            'Трубка кондиционера', 'Климат-контроль', 'Блок управления кондиционером',
            'Блок управления климат- контролем', 'Трубки кондиционера', 'Заслонка отопителя', 'Блок управления отопителем',
            'Печка', 'Кронштейн компрессора кондиционера', 'Блок управления климат-контролем',
            'Труба салона с печкой', 'Блок управления печкой', 'Радиатор отопителя', 'Трубка кодиционера короткая',
            'Радиатор отопителя печки', 'Блок управления климат- контролем', 'Радиаторы печки'
        ]
    },

    # Двигатель (ENGINE)
    'ENGINE': {
        'title': 'Двигатель',
        'subcategories': [
            'Двигатель', 'ГБЦ', 'Крышка двигателя', 'Щуп масляный', 'Подушка крепления двигателя',
            'Опора двигателя', 'Прокладка ГБЦ', 'Проводка ДВС', 'Шкив помпы', 'Кронштейн мотора',
            'Вал балансирный', 'Шкив коленвала', 'Кожух решетки радиатора', 'Декоративная крышка двигателя',
            'Впускной коллектор', 'Кронштейн двигателя', 'Коллектор впускной', 'Подушка двигателя',
            'Дросельная заслонка', 'Кронштейн опоры двигателя', 'Крепления двигателя', 'Подушки двигателя',
            'Термостат', 'Помпа', 'Корпус термостата', 'Крышка термостата', 'Натяжитель ремня генератора',
            'Насос ГУР'

        ]
    },

    # Топливная система (FUEL)
    'FUEL': {
        'title': 'Топливная система',
        'subcategories': [
            'Бензобак', 'Топливный насос', 'Топливная рампа', 'Заливная горловина бензобака',
            'Абсорбер топлива угольный', 'Абсорбер паров топлива', 'Топливный бак',
            'Фильтр угольный', 'Бак топливный', 'Горловина топливного бака', 'Крепление бензобака',
            'Заливная горловина'
        ]
    },

    # Выпускная система (EXHAUST)
    'EXHAUST': {
        'title': 'Выпускная система',
        'subcategories': [
            'Банка глушителя', 'Глушитель', 'Катализатор', 'Лямбда-зонд', 'Трубка выхлопных газов',
            'Часть глушителя', 'Глушитель основной', 'Выпускной коллектор', 'Глушитель в сборе'
        ]
    },

    # Трансмиссия (TRANSMISSION)
    'TRANSMISSION': {
        'title': 'Трансмиссия',
        'subcategories': [
            'МКПП', 'Корзина сцепления', 'Маховик', 'Кулиса МКПП с тросами', 'Селектор МКПП',
            'Раздаточная коробка раздатка', 'Привод', 'Полуось', 'Кронштейн трансмиссии',
            'Кулиса АКПП с тросами', 'Сцепление', 'Тросса МКПП', 'Блок контроля раздаточной коробки',
            'Блок управления полным приводом', 'Мост', 'Подкапотная проводка АКПП', 'АКПП',
            'Кулиса МКПП', 'КПП', 'Кулиса КПП', 'Трос КПП', 'Трубка цилиндра сцепления',
            'Вал раздаточной коробки', 'Карданный вал'
        ]
    },

    # Подвеска (SUSPENSION)
    'SUSPENSION': {
        'title': 'Подвеска',
        'subcategories': [
            'Рычаг подвески', 'Стабилизатор', 'Кулак', 'Кулак поворотный', 'Ступица',
            'Пружина стойки', 'Стойка амортизатора', 'Пружины', 'Стойки амортизатора',
            'Рычаг', 'Стабилизатор поперечной устойчивости', 'Рычаг со ступицей',
            'Крепление балки подвески', 'Балка подвески', 'Пружина подвески', 'Балка',
            'Стойки амортизаторов', 'Подрамник', 'Ступицы', 'Стойка', 'Поворотный кулак',
            'Пружина', 'Мост со стойками'
        ]
    },

    # Рулевое управление (STEERING)
    'STEERING': {
        'title': 'Рулевое управление',
        'subcategories': [
            'Кожух рулевой колонки', 'Руль', 'Трубка ГУР', 'Рулевая колонка', 'Рулевая рейка',
            'Радиатор ГУР', 'Рулевая рейка ГУР', 'Рулевой карданчик', 'ЭУР', 'Бачок ГУР',
            'Датчик угла поворота руля', 'Колонка рулевая'
        ]
    },

    # Тормозная система (BRAKES)
    'BRAKES': {
        'title': 'Тормозная система',
        'subcategories': [
            'Вакуумный усилитель тормозов', 'Главный цилиндр сцепления', 'Суппорт', 'Тормозной диск',
            'Тормозные трубки', 'Вакуумный усилитель', 'Трубки блока ABS', 'Трубка тормозная топливная',
            'Датчики ABS', 'Защита датчика ABS', 'Суппорт тормозной', 'Шланг тормозной', 'Тормозной суппорт',
            'Вакумный усилитель тормоза', 'Блок ABS', 'Датчик ABS', 'Усилитель тормоза'
        ]
    },

    # Электрооборудование (ELECTRICS)
    'ELECTRICS': {
        'title': 'Электрооборудование',
        'subcategories': [
            'Блок управления ABS', 'Блок Airbag', 'Блок комфорта', 'Блок управление двигателем',
            'Панель приборов', 'Проводка подкапотная', 'Проводка салона', 'Проводка', 'Проводка двери',
            'Дополнительный стоп-сигнал', 'Фонарь', 'Фара', 'Фары', 'Фонари', 'Фонари в крылья', 'Блок розжига ксенона', 'Блок стеклоподъемников',
            'Проводка части', 'Блок BCM', 'Проводка крышки багажника', 'Фонарь противотуманный',
            'Подрулевой шлейф', 'Разъем фары', 'Шлейф подрулевой', 'Блок управления фарой', 'Блок SOS',
            'Блок управления', 'Блок управления корректором фар', 'Зеркальный элемент', 'Катушка зажигания',
            'Клемма аккумулятора', 'Переключатель света фар', 'Плафон салона', 'Поводок дворника',
            'Трапеция дворников', 'Блок кнопок', 'Блок кнопок аварийки', 'Блок подогрева сидений',
            'Блок предохранителей реле', 'Блок предохранителей салона', 'Кнопка открывания багажника',
            'ПТФ', 'Шторка безопасности', 'Антенна на крышу', 'Динамики дверей', 'Магнитола',
            'Аудиосистема', 'Блок антенны', 'Блок управления центральным замком', 'Блок электронный глонас',
            'Поворотник', 'Форсунка стеклоомывателя', 'Корректор фар', 'Блок управления парктроником',
            'Проводка подпанельная', 'Блок управления вентилятором', 'Переключатель подрулевой',
            'Труба подпанельная', 'Спидометр', 'Накладка спидометра', 'Стрельнутая безопасность',
            'Рулевая колонка', 'Шлейф-лента подушки безопасности', 'Подушка безопасности',
            'Сигнал звуковой', 'Блок питания USB', 'ДХО', 'Генератор', 'Дроссельная заслонка', 'Замок зажигания с ключом', 'ЭБУ',
            'Блок предохранителей', 'Линзованная фара', 'Линзованные ПТФ', 'Фонари крышки багажника', 'Стоп-сигнал крышки багажника',
            'Блок управления двигателем', 'Фонарь крышки багажника', 'Блок предохранителей подкапотный', 'Фара противотуманная',
            'Блок навигации', 'Автомагнитола', 'Линзованные фары', 'Фонарь внутренний', 'Фонарь в крыло', 'Стартер', 'Кнопка обогрева сидения',
            'Блок управления airbag', 'Электропроводка двигателя', 'Фонари в крыло', 'Моторчик бачка омывателя', 'Стеклоподъемник двери',
            'Стоп-сигнал крышки багажника', 'Фонарь в крыло', 'Стеклоподъемник', 'Блок предохранителей под капот', 'Дополнительный стоп-сигнал',
            'Электропривод багажника', 'Фонарь в крышку багажника', 'Блок управления дверьми', 'Фонари в крышку багажника',
            'Фонарь в крышку', 'Лямбда-зонд', 'Клемма аккумулятора плюс', 'Блок стеклоподьемников',
            'Подушка безопасности водителя', 'Подушка безопасности пассажира', 'Подушка сидения', 'Дополнительный стоп-сигнал'

        ]
    },

    # Шины и диски (WHEELS)
    'WHEELS': {
        'title': 'Шины и диски',
        'subcategories': [
            'Колпаки колесные', 'Колпак', 'Колпаки', 'Запасное колесо', 'Шины', 'Диски', 'Колпак колеса', 'Диск', 'Шина'
        ]
    },

    # Прочие запчасти (OTHER)
    'OTHER': {
        'title': 'Прочие запчасти',
        'subcategories': [
            'Корпус воздушного фильтра', 'Патрубки',
            'Патрубки интеркулера', 'Защитный кожух воздушного фильтра',
            'Трапеция стеклоочистителя', 'Щетки стеклоочистителя', 'Вентилятор охлаждения',
            'Расширительный бачок', 'Радиатор охлаждения', 'Пыльник радиатора',
            'Заливная горловина радиатора', 'Трубка системы охлаждения', 'Вентилятор охлаждения двигателя',
            'Колокол сигнализации', 'Защита двигателя', 'Боковина с крылом'
        ]
    },
    'DONORS': {
        'title': 'Автомобили в разбор',
        'subcategories': [
            'Авто в разбор'
        ]
    }
}

GENERATION_MODELS = [
    'ceed 1', 'ceed 3', 'Cerato 3', 'Cerato 4', 'Duster 2', 'Focus 2',
    'Jetta 6', 'Megane 2', 'Megane 3', 'Mondeo 3', 'Optima 3', 'Optima 4',
    'Polo 5', 'Rio 3', 'Rio 4', 'Rapid 2', 'Santa Fe 4', 'Solaris 1',
    'Solaris 2', 'Sorento 2', 'Sorento Prime 3', 'Sportage 3', 'Sportage 4',
    'Tucson 3', 'Sandero Stepway 1', 'Sandero Stepway 2', 'Sandero 1', 'Sandero 2'
]


TRANSMISSION_MAP = {
    'АКПП': 'AT',
    'АВТОМАТ': 'AT',
    'МКПП': 'MT',
    'automatic:АКПП': 'AT',
    'manual:МКПП': 'MT',
    'AUTOMATIC:АКПП': 'AT',
    'MANUAL:МКПП': 'MT',
    'VARIATOR:CVT': 'AT'
}

CATEGORY_SLUG_MAP = {
    "ДВИГАТЕЛЬ": "engine",
    "КУЗОВНЫЕ ДЕТАЛИ": "body-parts",
    "ДЕТАЛИ САЛОНА": "interior-parts",
    "ЭЛЕКТРООБОРУДОВАНИЕ": "electrical-equipment",
    "ОТОПИТЕЛИ И КОНДИЦИОНИРОВАНИЕ": "hvac",
    "ПОДВЕСКА": "suspension",
    "ТОРМОЗНАЯ СИСТЕМА": "brake-system",
    "ВЫПУСКНАЯ СИСТЕМА": "exhaust-system",
    "ТОПЛИВНАЯ СИСТЕМА": "fuel-system",
    "РУЛЕВОЕ УПРАВЛЕНИЕ": "steering",
    "ТРАНСМИССИЯ": "transmission",
    "АВТОМОБИЛИ В РАЗБОР": "donor-vehicles",
    "ШИНЫ И ДИСКИ": "tires-and-wheels",
    "ПРОЧИЕ ЗАПЧАСТИ": "others",
}